App({
  onLaunch: function (options) {

  } ,
  onShow: function (options) {
    // Do something when show.
  },
  onHide: function () {
    // Do something when hide.
  },
  onError: function (msg) {
    console.log(msg)
  },
  globalData: {
    movement_comsume:0,
    base_comsume:0,
    hasUserInfo:false,
    movementList: {},
    list: {
      'breakfast': {
        id: 'breakfast',
        image: '/images/breakfast.png',
        name: '早餐',
        open: false,
        items: [],
        total: 0.0
      },
      'lunch': {
        id: 'lunch',
        image: '/images/lunch.png',
        name: '中餐',
        open: false,
        items: [],
        total: 0.0
      },
      'dinner': {
        id: 'dinner',
        image: '/images/dinner.png',
        name: '晚餐',
        open: false,
        items: [],
        total: 0.0
      },
      'aid': {
        id: 'aid',
        image: '/images/eat.png',
        name: '加餐',
        open: false,
        items: [],
        total: 0.0
      }
    },
    movementData: {
      '0001': ['收拾床铺', 2.0, 0,'家务'],
      '0002': ['洗碗', 2.3, 0, '家务'],
      '0003': ['做饭', 2.5, 0, '家务'],
      '0004': ['擦窗户', 2.8, 0, '家务'],
      '0005': ['手洗衣服', 3.3, 0, '家务'],
      '0006': ['扫地', 3.5, 0, '家务'],
      '0007': ['慢速（3km/h)', 2.5, 0, '步行'],
      '0008': ['中速（5km/h )', 3.5, 0, '步行'],
      '0009': ['快速（5.5~6km/h )', 4.0, 0, '步行'],
      '0010': ['很快（7km/h )', 4.5, 0, '步行'],
      '0011': ['下楼', 3.0, 0, '步行'],
      '0012': ['上楼', 8.0, 0, '步行'],
      '0013': ['上下楼', 4.5, 0, '步行'],
      '0014': ['走跑结合（慢跑成分不超过10min)', 6.0, 0, '跑步'],
      '0015': ['慢跑，一般', 7.0, 0, '跑步'],
      '0016': ['8km/h，原地', 8.0, 0, '跑步'],
      '0017': ['9km/h', 10, 0, '跑步'],
      '0018': ['跑，上楼', 15, 0, '跑步'],
      '0019': ['自行车(12~16km/h)', 4, 0, '骑行'],
      '0020': ['自行车(16~19km/h)', 6, 0, '骑行'],
      '0021': ['保龄球', 3, 0, '球类'],
      '0022': ['高尔夫球', 5, 0, '球类'],
      '0023': ['篮球.一般', 6, 0, '球类'],
      '0024': ['篮球，比赛', 7, 0, '球类'],
      '0025': ['排球，一般', 3, 0, '球类'],
      '0026': ['排球，比赛', 4, 0, '球类'],
      '0027': ['乒乓球', 4, 0, '球类'],
      '0028': ['台球', 2.5, 0, '球类'],
      '0029': ['网球.一般', 5, 0, '球类'],
      '0030': ['网球，双打', 6, 0, '球类'],
      '0031': ['网球，单打', 8, 0, '球类'],
      '0032': ['羽毛球，一般', 4.5, 0, '球类'],
      '0033': ['羽毛球，比赛', 7, 0, '球类'],
      '0034': ['足球，一般', 7, 0, '球类'],
      '0035': ['足球，比赛', 10, 0, '球类'],
      '0036': ['慢速', 8, 0, '跳绳'],
      '0037': ['中速，一般', 10, 0, '跳绳'],
      '0038': ['快速', 12, 0, '跳绳'],
      '0039': ['慢速', 3, 0, '舞蹈'],
      '0040': ['中速', 4.5, 0, '舞蹈'],
      '0041': ['快速', 5.5, 0, '舞蹈'],
      '0042': ['踩水，中等用力，一般', 4, 0, '游泳'],
      '0043': ['爬泳（慢），自由泳，仰泳', 8, 0, '游泳'],
      '0044': ['蛙泳，一般速度', 10, 0, '游泳'],
      '0045': ['爬泳（快)，蝶泳', 11, 0, '游泳'],
      '0046': ['瑜伽', 4, 0, '其他活动'],
      '0047': ['单杠', 5, 0, '其他活动'],
      '0048': ['俯卧撑', 4.5, 0, '其他活动'],
      '0049': ['太极拳', 3.5, 0, '其他活动'],
      '0050': ['健身操（轻或中等强度）', 5, 0, '其他活动'],
      '0051': ['轮滑旱冰', 7, 0, '其他活动']
    }
  }
})